HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxRif_bf.h
/**
 * \file IfxRif_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Rif_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Rif_Registers
 * 
 */
#ifndef IFXRIF_BF_H
#define IFXRIF_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Rif_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_RIF_CLC_Bits.DISR */
#define IFX_RIF_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.DISR */
#define IFX_RIF_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.DISR */
#define IFX_RIF_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_RIF_CLC_Bits.DISS */
#define IFX_RIF_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.DISS */
#define IFX_RIF_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.DISS */
#define IFX_RIF_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_RIF_CLC_Bits.EDIS */
#define IFX_RIF_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_RIF_CLC_Bits.EDIS */
#define IFX_RIF_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_RIF_CLC_Bits.EDIS */
#define IFX_RIF_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_RIF_ID_Bits.MODREV */
#define IFX_RIF_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_RIF_ID_Bits.MODREV */
#define IFX_RIF_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_RIF_ID_Bits.MODREV */
#define IFX_RIF_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_RIF_ID_Bits.MODTYPE */
#define IFX_RIF_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_RIF_ID_Bits.MODTYPE */
#define IFX_RIF_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_RIF_ID_Bits.MODTYPE */
#define IFX_RIF_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_RIF_ID_Bits.MODNUMBER */
#define IFX_RIF_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_RIF_ID_Bits.MODNUMBER */
#define IFX_RIF_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_ID_Bits.MODNUMBER */
#define IFX_RIF_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_RIF_ESI_Bits.CP */
#define IFX_RIF_ESI_CP_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CP */
#define IFX_RIF_ESI_CP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CP */
#define IFX_RIF_ESI_CP_OFF (0u)

/** \brief Length for Ifx_RIF_ESI_Bits.FP */
#define IFX_RIF_ESI_FP_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.FP */
#define IFX_RIF_ESI_FP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.FP */
#define IFX_RIF_ESI_FP_OFF (1u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP0 */
#define IFX_RIF_ESI_DP0_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP0 */
#define IFX_RIF_ESI_DP0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP0 */
#define IFX_RIF_ESI_DP0_OFF (2u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP1 */
#define IFX_RIF_ESI_DP1_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP1 */
#define IFX_RIF_ESI_DP1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP1 */
#define IFX_RIF_ESI_DP1_OFF (3u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP2 */
#define IFX_RIF_ESI_DP2_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP2 */
#define IFX_RIF_ESI_DP2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP2 */
#define IFX_RIF_ESI_DP2_OFF (4u)

/** \brief Length for Ifx_RIF_ESI_Bits.DP3 */
#define IFX_RIF_ESI_DP3_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.DP3 */
#define IFX_RIF_ESI_DP3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.DP3 */
#define IFX_RIF_ESI_DP3_OFF (5u)

/** \brief Length for Ifx_RIF_ESI_Bits.CALEN */
#define IFX_RIF_ESI_CALEN_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CALEN */
#define IFX_RIF_ESI_CALEN_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CALEN */
#define IFX_RIF_ESI_CALEN_OFF (16u)

/** \brief Length for Ifx_RIF_ESI_Bits.CALBSY */
#define IFX_RIF_ESI_CALBSY_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CALBSY */
#define IFX_RIF_ESI_CALBSY_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CALBSY */
#define IFX_RIF_ESI_CALBSY_OFF (17u)

/** \brief Length for Ifx_RIF_ESI_Bits.CALSTAT */
#define IFX_RIF_ESI_CALSTAT_LEN (1u)

/** \brief Mask for Ifx_RIF_ESI_Bits.CALSTAT */
#define IFX_RIF_ESI_CALSTAT_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ESI_Bits.CALSTAT */
#define IFX_RIF_ESI_CALSTAT_OFF (18u)

/** \brief Length for Ifx_RIF_IPI_Bits.DL */
#define IFX_RIF_IPI_DL_LEN (2u)

/** \brief Mask for Ifx_RIF_IPI_Bits.DL */
#define IFX_RIF_IPI_DL_MSK (0x3u)

/** \brief Offset for Ifx_RIF_IPI_Bits.DL */
#define IFX_RIF_IPI_DL_OFF (0u)

/** \brief Length for Ifx_RIF_IPI_Bits.PFP */
#define IFX_RIF_IPI_PFP_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.PFP */
#define IFX_RIF_IPI_PFP_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.PFP */
#define IFX_RIF_IPI_PFP_OFF (3u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN0 */
#define IFX_RIF_IPI_EN0_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN0 */
#define IFX_RIF_IPI_EN0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN0 */
#define IFX_RIF_IPI_EN0_OFF (16u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN1 */
#define IFX_RIF_IPI_EN1_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN1 */
#define IFX_RIF_IPI_EN1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN1 */
#define IFX_RIF_IPI_EN1_OFF (17u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN2 */
#define IFX_RIF_IPI_EN2_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN2 */
#define IFX_RIF_IPI_EN2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_IPI_Bits.EN2 */
#define IFX_RIF_IPI_EN2_OFF (18u)

/** \brief Length for Ifx_RIF_IPI_Bits.EN3 */
#define IFX_RIF_IPI_EN3_LEN (1u)

/** \brief Mask for Ifx_RIF_IPI_Bits.EN3 */
#define IFX_RIF_IPI_EN3_MSK (0x1u)

